; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c3-s3-p17-a1)
(:domain logistics-strips)
(:objects a0 
          c0 c1 c2 
          t0 t1 t2 
          l0-0 l0-1 l0-2 l1-0 l1-1 l1-2 l2-0 l2-1 l2-2 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 
)
(:init
    (AIRPLANE a0)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (OBJ p16)
    (at t0 l0-0)
    (at t1 l1-1)
    (at t2 l2-0)
    (at p0 l0-0)
    (at p1 l1-0)
    (at p2 l1-1)
    (at p3 l1-1)
    (at p4 l1-0)
    (at p5 l1-1)
    (at p6 l0-0)
    (at p7 l1-1)
    (at p8 l0-1)
    (at p9 l0-1)
    (at p10 l0-1)
    (at p11 l2-2)
    (at p12 l2-1)
    (at p13 l1-1)
    (at p14 l1-1)
    (at p15 l2-2)
    (at p16 l1-1)
    (at a0 l2-0)
)
(:goal
    (and
        (at p0 l2-1)
        (at p1 l0-1)
        (at p2 l2-1)
        (at p3 l1-1)
        (at p4 l1-0)
        (at p5 l1-2)
        (at p6 l1-2)
        (at p7 l1-1)
        (at p8 l0-2)
        (at p9 l2-0)
        (at p10 l2-2)
        (at p11 l1-1)
        (at p12 l1-1)
        (at p13 l2-1)
        (at p14 l0-1)
        (at p15 l2-1)
        (at p16 l2-2)
    )
)
)

; plan
1. (load-truck p16 t1 l1-1)
   deleted: (at p16 l1-1)
   added: (in p16 t1)
   goals met: 3 of 17
2. (load-truck p5 t1 l1-1)
   deleted: (at p5 l1-1)
   added: (in p5 t1)
   goals met: 3 of 17
3. (load-truck p2 t1 l1-1)
   deleted: (at p2 l1-1)
   added: (in p2 t1)
   goals met: 3 of 17
4. (load-truck p14 t1 l1-1)
   deleted: (at p14 l1-1)
   added: (in p14 t1)
   goals met: 3 of 17
5. (load-truck p13 t1 l1-1)
   deleted: (at p13 l1-1)
   added: (in p13 t1)
   goals met: 3 of 17
6. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 3 of 17
7. (unload-truck p16 t1 l1-0)
   deleted: (in p16 t1)
   added: (at p16 l1-0)
   goals met: 3 of 17
8. (unload-truck p2 t1 l1-0)
   deleted: (in p2 t1)
   added: (at p2 l1-0)
   goals met: 3 of 17
9. (unload-truck p14 t1 l1-0)
   deleted: (in p14 t1)
   added: (at p14 l1-0)
   goals met: 3 of 17
10. (unload-truck p13 t1 l1-0)
   deleted: (in p13 t1)
   added: (at p13 l1-0)
   goals met: 3 of 17
11. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 3 of 17
12. (unload-truck p5 t1 l1-2)
   deleted: (in p5 t1)
   added: (at p5 l1-2)
   goals met: 4 of 17
13. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 4 of 17
14. (load-truck p11 t2 l2-2)
   deleted: (at p11 l2-2)
   added: (in p11 t2)
   goals met: 4 of 17
15. (load-truck p15 t2 l2-2)
   deleted: (at p15 l2-2)
   added: (in p15 t2)
   goals met: 4 of 17
16. (drive-truck t2 l2-2 l2-0 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-0)
   goals met: 4 of 17
17. (unload-truck p11 t2 l2-0)
   deleted: (in p11 t2)
   added: (at p11 l2-0)
   goals met: 4 of 17
18. (load-airplane p11 a0 l2-0)
   deleted: (at p11 l2-0)
   added: (in p11 a0)
   goals met: 4 of 17
19. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 4 of 17
20. (load-truck p12 t2 l2-1)
   deleted: (at p12 l2-1)
   added: (in p12 t2)
   goals met: 4 of 17
21. (unload-truck p15 t2 l2-1)
   deleted: (in p15 t2)
   added: (at p15 l2-1)
   goals met: 5 of 17
22. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 5 of 17
23. (unload-truck p12 t2 l2-0)
   deleted: (in p12 t2)
   added: (at p12 l2-0)
   goals met: 5 of 17
24. (load-airplane p12 a0 l2-0)
   deleted: (at p12 l2-0)
   added: (in p12 a0)
   goals met: 5 of 17
25. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 5 of 17
26. (load-truck p8 t0 l0-1)
   deleted: (at p8 l0-1)
   added: (in p8 t0)
   goals met: 5 of 17
27. (load-truck p9 t0 l0-1)
   deleted: (at p9 l0-1)
   added: (in p9 t0)
   goals met: 5 of 17
28. (load-truck p10 t0 l0-1)
   deleted: (at p10 l0-1)
   added: (in p10 t0)
   goals met: 5 of 17
29. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 5 of 17
30. (unload-truck p9 t0 l0-0)
   deleted: (in p9 t0)
   added: (at p9 l0-0)
   goals met: 5 of 17
31. (unload-truck p10 t0 l0-0)
   deleted: (in p10 t0)
   added: (at p10 l0-0)
   goals met: 5 of 17
32. (drive-truck t0 l0-0 l0-2 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-2)
   goals met: 5 of 17
33. (unload-truck p8 t0 l0-2)
   deleted: (in p8 t0)
   added: (at p8 l0-2)
   goals met: 6 of 17
34. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 6 of 17
35. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 6 of 17
36. (load-airplane p0 a0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 a0)
   goals met: 6 of 17
37. (load-airplane p9 a0 l0-0)
   deleted: (at p9 l0-0)
   added: (in p9 a0)
   goals met: 6 of 17
38. (load-airplane p6 a0 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 a0)
   goals met: 6 of 17
39. (load-airplane p10 a0 l0-0)
   deleted: (at p10 l0-0)
   added: (in p10 a0)
   goals met: 6 of 17
40. (fly-airplane a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 6 of 17
41. (unload-airplane p0 a0 l2-0)
   deleted: (in p0 a0)
   added: (at p0 l2-0)
   goals met: 6 of 17
42. (load-truck p0 t2 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 t2)
   goals met: 6 of 17
43. (unload-airplane p9 a0 l2-0)
   deleted: (in p9 a0)
   added: (at p9 l2-0)
   goals met: 7 of 17
44. (unload-airplane p10 a0 l2-0)
   deleted: (in p10 a0)
   added: (at p10 l2-0)
   goals met: 7 of 17
45. (load-truck p10 t2 l2-0)
   deleted: (at p10 l2-0)
   added: (in p10 t2)
   goals met: 7 of 17
46. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 7 of 17
47. (unload-truck p10 t2 l2-2)
   deleted: (in p10 t2)
   added: (at p10 l2-2)
   goals met: 8 of 17
48. (drive-truck t2 l2-2 l2-1 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-1)
   goals met: 8 of 17
49. (unload-truck p0 t2 l2-1)
   deleted: (in p0 t2)
   added: (at p0 l2-1)
   goals met: 9 of 17
50. (fly-airplane a0 l2-0 l1-0)
   deleted: (at a0 l2-0)
   added: (at a0 l1-0)
   goals met: 9 of 17
51. (load-airplane p16 a0 l1-0)
   deleted: (at p16 l1-0)
   added: (in p16 a0)
   goals met: 9 of 17
52. (load-airplane p2 a0 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 a0)
   goals met: 9 of 17
53. (load-airplane p14 a0 l1-0)
   deleted: (at p14 l1-0)
   added: (in p14 a0)
   goals met: 9 of 17
54. (load-airplane p1 a0 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 a0)
   goals met: 9 of 17
55. (load-airplane p13 a0 l1-0)
   deleted: (at p13 l1-0)
   added: (in p13 a0)
   goals met: 9 of 17
56. (unload-airplane p12 a0 l1-0)
   deleted: (in p12 a0)
   added: (at p12 l1-0)
   goals met: 9 of 17
57. (unload-airplane p11 a0 l1-0)
   deleted: (in p11 a0)
   added: (at p11 l1-0)
   goals met: 9 of 17
58. (unload-airplane p6 a0 l1-0)
   deleted: (in p6 a0)
   added: (at p6 l1-0)
   goals met: 9 of 17
59. (fly-airplane a0 l1-0 l2-0)
   deleted: (at a0 l1-0)
   added: (at a0 l2-0)
   goals met: 9 of 17
60. (unload-airplane p16 a0 l2-0)
   deleted: (in p16 a0)
   added: (at p16 l2-0)
   goals met: 9 of 17
61. (unload-airplane p2 a0 l2-0)
   deleted: (in p2 a0)
   added: (at p2 l2-0)
   goals met: 9 of 17
62. (unload-airplane p13 a0 l2-0)
   deleted: (in p13 a0)
   added: (at p13 l2-0)
   goals met: 9 of 17
63. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 9 of 17
64. (unload-airplane p14 a0 l0-0)
   deleted: (in p14 a0)
   added: (at p14 l0-0)
   goals met: 9 of 17
65. (load-truck p14 t0 l0-0)
   deleted: (at p14 l0-0)
   added: (in p14 t0)
   goals met: 9 of 17
66. (unload-airplane p1 a0 l0-0)
   deleted: (in p1 a0)
   added: (at p1 l0-0)
   goals met: 9 of 17
67. (load-truck p1 t0 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t0)
   goals met: 9 of 17
68. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 9 of 17
69. (unload-truck p14 t0 l0-1)
   deleted: (in p14 t0)
   added: (at p14 l0-1)
   goals met: 10 of 17
70. (unload-truck p1 t0 l0-1)
   deleted: (in p1 t0)
   added: (at p1 l0-1)
   goals met: 11 of 17
71. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 11 of 17
72. (load-truck p12 t1 l1-0)
   deleted: (at p12 l1-0)
   added: (in p12 t1)
   goals met: 11 of 17
73. (load-truck p11 t1 l1-0)
   deleted: (at p11 l1-0)
   added: (in p11 t1)
   goals met: 11 of 17
74. (load-truck p6 t1 l1-0)
   deleted: (at p6 l1-0)
   added: (in p6 t1)
   goals met: 11 of 17
75. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 11 of 17
76. (unload-truck p12 t1 l1-1)
   deleted: (in p12 t1)
   added: (at p12 l1-1)
   goals met: 12 of 17
77. (unload-truck p11 t1 l1-1)
   deleted: (in p11 t1)
   added: (at p11 l1-1)
   goals met: 13 of 17
78. (drive-truck t1 l1-1 l1-2 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-2)
   goals met: 13 of 17
79. (unload-truck p6 t1 l1-2)
   deleted: (in p6 t1)
   added: (at p6 l1-2)
   goals met: 14 of 17
80. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 14 of 17
81. (load-truck p16 t2 l2-0)
   deleted: (at p16 l2-0)
   added: (in p16 t2)
   goals met: 14 of 17
82. (load-truck p2 t2 l2-0)
   deleted: (at p2 l2-0)
   added: (in p2 t2)
   goals met: 14 of 17
83. (load-truck p13 t2 l2-0)
   deleted: (at p13 l2-0)
   added: (in p13 t2)
   goals met: 14 of 17
84. (drive-truck t2 l2-0 l2-2 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-2)
   goals met: 14 of 17
85. (unload-truck p16 t2 l2-2)
   deleted: (in p16 t2)
   added: (at p16 l2-2)
   goals met: 15 of 17
86. (drive-truck t2 l2-2 l2-1 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-1)
   goals met: 15 of 17
87. (unload-truck p2 t2 l2-1)
   deleted: (in p2 t2)
   added: (at p2 l2-1)
   goals met: 16 of 17
88. (unload-truck p13 t2 l2-1)
   deleted: (in p13 t2)
   added: (at p13 l2-1)
   goals met: 17 of 17
